system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Project:  Bridge Deck Pressure-Flow Scour Study |
|    \\/     M anipulation  | Case:     3C_VOF 5-Layer Layout (~55k Cells)        |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
    // Layer 0: Bed Bottom (y = -0.12000 m)
    (-1.50000 -0.12000 0.0)  // 0
    (-0.50000 -0.12000 0.0)  // 1
    ( 0.00000 -0.12000 0.0)  // 2
    ( 0.15300 -0.12000 0.0)  // 3
    ( 0.80000 -0.12000 0.0)  // 4
    ( 2.00000 -0.12000 0.0)  // 5

    // Layer 1: Mid Bed (y = -0.04000 m)
    (-1.50000 -0.04000 0.0)  // 6
    (-0.50000 -0.04000 0.0)  // 7
    ( 0.00000 -0.04000 0.0)  // 8
    ( 0.15300 -0.04000 0.0)  // 9
    ( 0.80000 -0.04000 0.0)  // 10
    ( 2.00000 -0.04000 0.0)  // 11

    // Layer 2: Initial Bed Surface (y = 0.00000 m)
    (-1.50000  0.00000 0.0)  // 12
    (-0.50000  0.00000 0.0)  // 13
    ( 0.00000  0.00000 0.0)  // 14
    ( 0.15300  0.00000 0.0)  // 15
    ( 0.80000  0.00000 0.0)  // 16
    ( 2.00000  0.00000 0.0)  // 17

    // Layer 3: Deck Soffit Elevation (Hb = 0.07700 m)
    (-1.50000  0.07700 0.0)  // 18
    (-0.50000  0.07700 0.0)  // 19
    ( 0.00000  0.07700 0.0)  // 20
    ( 0.15300  0.07700 0.0)  // 21
    ( 0.80000  0.07700 0.0)  // 22
    ( 2.00000  0.07700 0.0)  // 23

    // Layer 4: Deck Top Level (y = 0.20000 m)
    (-1.50000  0.20000 0.0)  // 24
    (-0.50000  0.20000 0.0)  // 25
    ( 0.00000  0.20000 0.0)  // 26
    ( 0.15300  0.20000 0.0)  // 27
    ( 0.80000  0.20000 0.0)  // 28
    ( 2.00000  0.20000 0.0)  // 29

    // Layer 5: Atmosphere Top (y = 0.31070 m)
    (-1.50000  0.31070 0.0)  // 30
    (-0.50000  0.31070 0.0)  // 31
    ( 0.00000  0.31070 0.0)  // 32
    ( 0.15300  0.31070 0.0)  // 33
    ( 0.80000  0.31070 0.0)  // 34
    ( 2.00000  0.31070 0.0)  // 35

    // z = 0.01 m (Front plane offset +36)
    (-1.50000 -0.12000 0.01) // 36
    (-0.50000 -0.12000 0.01) // 37
    ( 0.00000 -0.12000 0.01) // 38
    ( 0.15300 -0.12000 0.01) // 39
    ( 0.80000 -0.12000 0.01) // 40
    ( 2.00000 -0.12000 0.01) // 41

    (-1.50000 -0.04000 0.01) // 42
    (-0.50000 -0.04000 0.01) // 43
    ( 0.00000 -0.04000 0.01) // 44
    ( 0.15300 -0.04000 0.01) // 45
    ( 0.80000 -0.04000 0.01) // 46
    ( 2.00000 -0.04000 0.01) // 47

    (-1.50000  0.00000 0.01) // 48
    (-0.50000  0.00000 0.01) // 49
    ( 0.00000  0.00000 0.01) // 50
    ( 0.15300  0.00000 0.01) // 51
    ( 0.80000  0.00000 0.01) // 52
    ( 2.00000  0.00000 0.01) // 53

    (-1.50000  0.07700 0.01) // 54
    (-0.50000  0.07700 0.01) // 55
    ( 0.00000  0.07700 0.01) // 56
    ( 0.15300  0.07700 0.01) // 57
    ( 0.80000  0.07700 0.01) // 58
    ( 2.00000  0.07700 0.01) // 59

    (-1.50000  0.20000 0.01) // 60
    (-0.50000  0.20000 0.01) // 61
    ( 0.00000  0.20000 0.01) // 62
    ( 0.15300  0.20000 0.01) // 63
    ( 0.80000  0.20000 0.01) // 64
    ( 2.00000  0.20000 0.01) // 65

    (-1.50000  0.31070 0.01) // 66
    (-0.50000  0.31070 0.01) // 67
    ( 0.00000  0.31070 0.01) // 68
    ( 0.15300  0.31070 0.01) // 69
    ( 0.80000  0.31070 0.01) // 70
    ( 2.00000  0.31070 0.01) // 71
);

blocks
(
    // Layer 1: Deep Sand Bed (-0.120 to -0.040 m, dy = 80 mm -> 12 cells)
    hex ( 0  1  7  6 36 37 43 42)        ( 50 12 1) simpleGrading (1.24 0.12 1) // Block 1
    hex ( 1  2  8  7 37 38 44 43)        ( 50 12 1) simpleGrading (0.08 0.12 1) // Block 2
    hex ( 2  3  9  8 38 39 45 44)        ( 50 12 1) simpleGrading (((0.5 0.5 2.0) (0.5 0.5 0.5)) 0.12 1) // Block 3
    hex ( 3  4 10  9 39 40 46 45)        (150 12 1) simpleGrading (((0.5 0.65 2.5) (0.5 0.35 2.0)) 0.12 1) // Block 4
    hex ( 4  5 11 10 40 41 47 46)        (100 12 1) simpleGrading (3.5 0.12 1) // Block 5

    // Layer 2: Upper Sand Bed (-0.040 to 0.000 m, dy = 40 mm -> 30 cells)
    hex ( 6  7 13 12 42 43 49 48)        ( 50 30 1) simpleGrading (1.24 0.5 1) // Block 6
    hex ( 7  8 14 13 43 44 50 49)        ( 50 30 1) simpleGrading (0.08 0.5 1) // Block 7
    hex ( 8  9 15 14 44 45 51 50)        ( 50 30 1) simpleGrading (((0.5 0.5 2.0) (0.5 0.5 0.5)) 0.5 1) // Block 8
    hex ( 9 10 16 15 45 46 52 51)        (150 30 1) simpleGrading (((0.5 0.65 2.5) (0.5 0.35 2.0)) 0.5 1) // Block 9
    hex (10 11 17 16 46 47 53 52)        (100 30 1) simpleGrading (3.5 0.5 1) // Block 10

    // Layer 3: Water Column / Pressure Flow Zone (0.000 to Hb = 0.07700 m, dy = 77 mm -> 40 cells)
    hex (12 13 19 18 48 49 55 54)        ( 50 40 1) simpleGrading (1.24 ((0.5 0.5 2.0) (0.5 0.5 0.5)) 1) // Block 11
    hex (13 14 20 19 49 50 56 55)        ( 50 40 1) simpleGrading (0.08 ((0.5 0.5 2.0) (0.5 0.5 0.5)) 1) // Block 12
    hex (14 15 21 20 50 51 57 56)        ( 50 40 1) simpleGrading (((0.5 0.5 2.0) (0.5 0.5 0.5)) ((0.5 0.5 2.0) (0.5 0.5 0.5)) 1) // Block 13
    hex (15 16 22 21 51 52 58 57)        (150 40 1) simpleGrading (((0.5 0.65 2.5) (0.5 0.35 2.0)) ((0.5 0.5 2.0) (0.5 0.5 0.5)) 1) // Block 14
    hex (16 17 23 22 52 53 59 58)        (100 40 1) simpleGrading (3.5 ((0.5 0.5 2.0) (0.5 0.5 0.5)) 1) // Block 15

    // Layer 4: Deck Level (Hb = 0.07700 to Y = 0.20000 m, dy = 123 mm -> 35 cells)
    hex (18 19 25 24 54 55 61 60)        ( 50 35 1) simpleGrading (1.24 ((0.5 0.5 2.0) (0.5 0.5 0.5)) 1) // Block 16
    hex (19 20 26 25 55 56 62 61)        ( 50 35 1) simpleGrading (0.08 ((0.5 0.5 2.0) (0.5 0.5 0.5)) 1) // Block 17
    // [SOLID BRIDGE DECK OMITTED HERE: x in (0.000, 0.153), y in (0.07700, 0.20000)]
    hex (21 22 28 27 57 58 64 63)        (150 35 1) simpleGrading (((0.5 0.65 2.5) (0.5 0.35 2.0)) ((0.5 0.5 2.0) (0.5 0.5 0.5)) 1) // Block 18
    hex (22 23 29 28 58 59 65 64)        (100 35 1) simpleGrading (3.5 ((0.5 0.5 2.0) (0.5 0.5 0.5)) 1) // Block 19

    // Layer 5: Atmosphere Air Zone (Y = 0.20000 to Y = 0.31070 m, dy = 110.7 mm -> 25 cells)
    hex (24 25 31 30 60 61 67 66)        ( 50 25 1) simpleGrading (1.24 2.0 1) // Block 20
    hex (25 26 32 31 61 62 68 67)        ( 50 25 1) simpleGrading (0.08 2.0 1) // Block 21
    hex (26 27 33 32 62 63 69 68)        ( 50 25 1) simpleGrading (((0.5 0.5 2.0) (0.5 0.5 0.5)) 2.0 1) // Block 22
    hex (27 28 34 33 63 64 70 69)        (150 25 1) simpleGrading (((0.5 0.65 2.5) (0.5 0.35 2.0)) 2.0 1) // Block 23
    hex (28 29 35 34 64 65 71 70)        (100 25 1) simpleGrading (3.5 2.0 1) // Block 24
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (12 18 54 48)
            (18 24 60 54)
            (24 30 66 60)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (5 11 47 41)
            (11 17 53 47)
            (17 23 59 53)
            (23 29 65 59)
            (29 35 71 65)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 1 37 36)
            (1 2 38 37)
            (2 3 39 38)
            (3 4 40 39)
            (4 5 41 40)
            (0 6 42 36)
            (6 12 48 42)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (30 31 67 66)
            (31 32 68 67)
            (32 33 69 68)
            (33 34 70 69)
            (34 35 71 70)
        );
    }
    bridgeDeck
    {
        type wall;
        faces
        (
            (20 21 57 56) // Deck Soffit (bottom)
            (20 26 62 56) // Deck Leading Edge (upstream face)
            (21 27 63 57) // Deck Trailing Edge (downstream face)
            (26 27 63 62) // Deck Top Surface
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            ( 0  1  7  6)
            ( 1  2  8  7)
            ( 2  3  9  8)
            ( 3  4 10  9)
            ( 4  5 11 10)
            ( 6  7 13 12)
            ( 7  8 14 13)
            ( 8  9 15 14)
            ( 9 10 16 15)
            (10 11 17 16)
            (12 13 19 18)
            (13 14 20 19)
            (14 15 21 20)
            (15 16 22 21)
            (16 17 23 22)
            (18 19 25 24)
            (19 20 26 25)
            (21 22 28 27)
            (22 23 29 28)
            (24 25 31 30)
            (25 26 32 31)
            (26 27 33 32)
            (27 28 34 33)
            (28 29 35 34)

            (36 42 43 37)
            (37 43 44 38)
            (38 44 45 39)
            (39 45 46 40)
            (40 46 47 41)
            (42 48 49 43)
            (43 49 50 44)
            (44 50 51 45)
            (45 51 52 46)
            (46 52 53 47)
            (48 54 55 49)
            (49 55 56 50)
            (50 56 57 51)
            (51 57 58 52)
            (52 58 59 53)
            (54 60 61 55)
            (55 61 62 56)
            (57 63 64 58)
            (58 64 65 59)
            (60 66 67 61)
            (61 67 68 62)
            (62 68 69 63)
            (63 69 70 64)
            (64 70 71 65)
        );
    }
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
