system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Project:  Bridge Deck Pressure-Flow Scour Study |
|    \\/     M anipulation  | Case:     3C_VOF createPatchDict                |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

patches
(
    {
        name backPlane;
        patchInfo
        {
            type empty;
        }
        constructFrom faceSet;
        set backFaces;
    }
);

// ************************************************************************* //
