system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Project:  Bridge Deck Pressure-Flow Scour Study |
|    \\/     M anipulation  | Case:     3C_VOF extrudeMeshDict                |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Source of 2D face to extrude
constructFrom mesh;

sourceCase ".";

// Extract front boundary faces
sourcePatches (frontAndBack);

flipNormals false;
mergeFaces  false;

// Extrusion model
extrudeModel linearDirection;

linearDirectionCoeffs
{
    direction (0 0 1);
    thickness 0.00125;
}

nLayers 1;

expansionRatio 1.0;

// Front and back patch specifications for 2D OpenFOAM solver
frontPatchName frontAndBack;
backPatchName  frontAndBack;

// Patch types
frontPatchType empty;
backPatchType  empty;

// ************************************************************************* //
