system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Project:  Bridge Deck Pressure-Flow Scour Study |
|    \\/     M anipulation  | Case:     3C_VOF 2D snappyHexMeshDict           |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            false;
addLayers       false;

geometry
{
    // Level 1: Broad Approach & Bed Buffer Box
    level1Box
    {
        type searchableBox;
        min (-0.50 -0.05 -0.10);
        max ( 0.80  0.20  0.10);
    }

    // Level 2: Near-Deck & Scour Transition Box
    level2Box
    {
        type searchableBox;
        min (-0.20 -0.03 -0.10);
        max ( 0.45  0.14  0.10);
    }

    // Level 3: Fine Deck & Scour Core Box
    level3Box
    {
        type searchableBox;
        min (-0.06 -0.015 -0.10);
        max ( 0.28  0.095  0.10);
    }
};

castellatedMeshControls
{
    maxLocalCells   1000000;
    maxGlobalCells  2000000;
    minRefinementCells 0;

    // Smooth transition buffer
    nCellsBetweenLevels 2;

    features
    (
    );

    refinementSurfaces
    {
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
        level1Box
        {
            mode inside;
            levels ((1E15 1));
        }
        level2Box
        {
            mode inside;
            levels ((1E15 2));
        }
        level3Box
        {
            mode inside;
            levels ((1E15 3));
        }
    }

    // Reference point inside fluid domain
    locationInMesh (-0.25 0.040 0.005);

    allowFreeStandingZoneFaces true;
    planarAngle 30;
    maxLoadUnbalance 0.10;
}

snapControls
{
    nSmoothPatch        3;
    tolerance           2.0;
    nSolveIter          30;
    nRelaxIter          5;
    nFeatureSnapIter    10;
}

addLayersControls
{
    relativeSizes       true;
    layers
    {
    }
    expansionRatio      1.0;
    finalLayerThickness 0.3;
    minThickness        0.1;
    nGrow               0;
}

meshQualityControls
{
    maxNonOrtho         65;
    maxBoundarySkewness 20;
    maxInternalSkewness  4;
    maxConcave          80;
    minFlatness        0.5;
    minVol         1.00E-13;
    minTetQuality     1e-15;
    minArea             -1;
    minTwist          0.02;
    minDeterminant   0.001;
    minFaceWeight     0.05;
    minVolRatio       0.01;
    minTriangleTwist    -1;
    nSmoothScale         4;
    errorReduction    0.75;

    relaxed
    {
        maxNonOrtho 75;
    }
}

debug 0;
mergeTolerance 1E-6;

// ************************************************************************* //
