constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


6
(
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       109473;
    }

    outlet
    {
        type            patch;
        nFaces          142;
        startFace       109573;
    }

    bottom
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          442;
        startFace       109715;
    }

    atmosphere
    {
        type            patch;
        nFaces          400;
        startFace       110157;
    }

    bridgeDeck
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          170;
        startFace       110557;
    }

    frontAndBack
    {
        type            empty;
        inGroups        1 ( empty );
        nFaces          110100;
        startFace       110727;
    }

)


// ************************************************************************* //
