constant/granularRheologyProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Project:  Bridge Deck Pressure-Flow Scour Study |
|    \\/     M anipulation  | Author:   Divyansh Kumar Singh (IIT Kanpur)     |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      granularRheologyProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

granularRheology   on;

granularDilatancy  off;

alphasMaxG  alphasMaxG [ 0 0 0 0 0 0 0 ]  0.635;
muss        muss       [ 0 0 0 0 0 0 0 ]  0.63;
mu2         mu2        [ 0 0 0 0 0 0 0 ]  1.13;
I0          I0         [ 0 0 0 0 0 0 0 ]  0.6;
Bphi        Bphi       [ 0 0 0 0 0 0 0 ]  0.66;
n           n          [ 0 0 0 0 0 0 0 ]  2.5;
Dsmall      Dsmall     [ 0 0 -1 0 0 0 0 ] 1e-4;
relaxPs     relaxPs    [ 0 0 0 0 0 0 0 ]  1e-5;

FrictionModel         MuI;
PPressureModel        MuI;
FluidViscosityModel   BoyerEtAl;

// ************************************************************************* //
