constant/kineticTheoryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2412                                 |
|   \  /    A nd           | Project:  Bridge Deck Pressure-Flow Scour Study |
|    \/     M anipulation  | Author:   Divyansh Kumar Singh (IIT Kanpur)     |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      kineticTheoryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

kineticTheory   off;

limitProduction off;

extended        off;

e               e [ 0 0 0 0 0 0 0 ] 0.7;

muPart          muPart [ 0 0 0 0 0 0 0 ] 0.4;

alphaMax        alphaMax [ 0 0 0 0 0 0 0 ] 0.635;

MaxTheta       MaxTheta [ 0 2 -2 0 0 0 0 ] 0.01;

phi             phi [ 0 0 0 0 0 0 0 ] 20.487; //mus = 0.35 = sin(phi*pi/180)

psi             psi [ 0 0 0 0 0 0 0 ] 0.0;

killJ2_       killJ2_ [ 0 0 0 0 0 0 0] 0;

quadraticCorrectionJ1_ quadraticCorrectionJ1_ [ 0 0 0 0 0 0 0 ] 0;

viscosityModel  Syamlal;

conductivityModel Syamlal;

granularPressureModel Lun;

radialModel     CarnahanStarling;

// ************************************************************************* //
