constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * sediment properties * * * * * * * * * * * * //
phasesolid
{
    rho             rho [ 1 -3 0 0 0 ] 2650;
    nu              nu [ 0 2 -1 0 0 ] 1e-4;
    d               d [ 0 1 0 0 0 0 0 ] 2.3e-4;
    sF              sF [ 0 0 0 0 0 0 0 ] 1;
    hExp            hExp [ 0 0 0 0 0 0 0 ] 2.65;
}

phasewater
{
    rho             rho [ 1 -3 0 0 0 ] 1000;
    nu              nu [ 0 2 -1 0 0 ] 1e-6;
    d               d [ 0 1 0 0 0 0 0 ] 3e-3;
    sF              sF [ 0 0 0 0 0 0 0 ] 0.5;
    hExp            hExp [ 0 0 0 0 0 0 0 ] 2.65;
}

phasegas
{
    rho             rho [ 1 -3 0 0 0 ] 1;
    nu              nu [ 0 2 -1 0 0 ] 1.48e-5;
    d               d [ 0 1 0 0 0 0 0 ] 3e-3;
    sF              sF [ 0 0 0 0 0 0 0 ] 0.5;
    hExp            hExp [ 0 0 0 0 0 0 0 ] 2.65;
}

phases (water air solid);

water
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1e-6;
    rho             rho [ 1 -3 0 0 0 0 0 ] 1000;
    CrossPowerLawCoeffs
    {
        nu0             nu0 [ 0 2 -1 0 0 0 0 ] 1e-6;
        nuInf           nuInf [ 0 2 -1 0 0 0 0 ] 1e-6;
        m               m [ 0 0 1 0 0 0 0 ] 1;
        n               n [ 0 0 0 0 0 0 0 ] 0;
    }

    BirdCarreauCoeffs
    {
        nu0             nu0 [ 0 2 -1 0 0 0 0 ] 0.0142515;
        nuInf           nuInf [ 0 2 -1 0 0 0 0 ] 1e-6;
        k               k [ 0 0 1 0 0 0 0 ] 99.6;
        n               n [ 0 0 0 0 0 0 0 ] 0.1003;
    }
}

air
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1.48e-5;
    rho             rho [ 1 -3 0 0 0 0 0 ] 1;
    CrossPowerLawCoeffs
    {
        nu0             nu0 [ 0 2 -1 0 0 0 0 ] 1e-6;
        nuInf           nuInf [ 0 2 -1 0 0 0 0 ] 1e-6;
        m               m [ 0 0 1 0 0 0 0 ] 1;
        n               n [ 0 0 0 0 0 0 0 ] 0;
    }

    BirdCarreauCoeffs
    {
        nu0             nu0 [ 0 2 -1 0 0 0 0 ] 0.0142515;
        nuInf           nuInf [ 0 2 -1 0 0 0 0 ] 1e-6;
        k               k [ 0 0 1 0 0 0 0 ] 99.6;
        n               n [ 0 0 0 0 0 0 0 ] 0.1003;
    }
}

sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.07;
sigmagf         sigmagf [ 1 0 -2 0 0 0 0 ] 0.07;

//*********************************************************************** //

transportModel  Newtonian;

nu              nu [ 0 2 -1 0 0 0 0 ] 1e-6;

nuMax           nuMax [ 0 2 -1 0 0 0 0 ] 1e2;

alphasSmall     alphasSmall [ 0 0 0 0 0 0 0 ] 1e-3;

alphaAlpha      alphaAlpha [ 0 0 0 0 0 0 0 ] 0;

waves2Foam      true;
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
