constant/twophaseRASProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2412                                 |
|   \  /    A nd           | Project:  Bridge Deck Pressure-Flow Scour Study |
|    \/     M anipulation  | Author:   Divyansh Kumar Singh (IIT Kanpur)     |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      twophaseRASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


// * * * * * definition of turbulence coefficient and others * * * * * * * * //

// Shared coefficients
SUS             SUS [ 0 0 0 0 0 0 0 ] 1.;
KE1             KE1 [ 0 0 0 0 0 0 0 ] 0;  //density stra (Uf-Us)
KE3             KE3 [ 0 0 0 0 0 0 0 ] 0;  //turb generation
B               B [ 0 0 0 0 0 0 0 ] 1.0; //turb modulation coeff

// Limiters
Tpsmall         Tpsmall [1 -3 -1 0 0 0 0] 1e-6;

// ************************************************************************* //
