0_org/Theta
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2412                                 |
|   \  /    A nd           | Project:  Bridge Deck Pressure-Flow Scour Study |
|    \/     M anipulation  | Author:   Divyansh Kumar Singh (IIT Kanpur)     |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Theta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-12;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 293.15;
    }
    outlet
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    atmosphere
    {
        type            slip;
    }
    bridgeDeck
    {
        type            zeroGradient;
    }
    deckSides
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}
