0_org/epsilon.fluid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon.fluid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 4.6081e-5; 

boundaryField
{
    inlet           
    {
        type            fixedValue;
        value           uniform 4.6081e-5;
    }
    outlet
    {
        type            zeroGradient;
    }
    bottom           
    {
        type            zeroGradient;
    }
    bridgeDeck           
    {
        type            zeroGradient;
    }
    atmosphere      
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
