0_org/gamma
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Project:  Bridge Deck Pressure-Flow Scour Study |
|    \\/     M anipulation  | Author:   Divyansh Kumar Singh (IIT Kanpur)     |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      gamma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform  0;

boundaryField
{
    inlet
    {
        type            codedFixedValue;
        value           uniform 0;
        name            gammaInletSmooth;

        codeInclude
        #{
            #include "fvCFD.H"
        #};

        codeOptions
        #{
            -I$(LIB_SRC)/finiteVolume/lnInclude \
            -I$(LIB_SRC)/meshTools/lnInclude
        #};

        codeLibs
        #{
            -lfiniteVolume \
            -lmeshTools
        #};

        code
        #{
            // Smooth 3mm tanh transition centered at the equilibrium backwater height Y = 0.1620 m
            // Eliminates inlet step jump and water-air interface distortion at x = -1.5 m
            const fvPatch& boundaryPatch = patch();
            const vectorField& Cf = boundaryPatch.Cf();
            scalarField& field = *this;
            const scalar ySurf = 0.1620;

            forAll(Cf, faceI)
            {
                scalar yVal = Cf[faceI].y();
                if (yVal <= 0.0)
                {
                    field[faceI] = 1.0;
                }
                else
                {
                    field[faceI] = 0.5 * (1.0 - tanh((yVal - ySurf) / 0.003));
                }
            }
        #};
    }
    outlet
    {
        type            zeroGradient;
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    bottom
    {
        type            zeroGradient;
    }
    bridgeDeck
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
