system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Project:  Bridge Deck Pressure-Flow Scour Study |
|    \\/     M anipulation  | Author:   Divyansh Kumar Singh (IIT Kanpur)     |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0;
        smoother        DIC;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    p_rghFinal
    {
        $p_rgh;
    }

    "(ps|ps_new_value|alphasPlastic)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0.001;
    }

    "(psFinal|ps_new_valueFinal|alphasPlasticFinal)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }
    alpha.solid
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }
    alpha.solidFinal
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0;
    }
    gamma
    {
        MULESCorr       yes;
        nLimiterIter    5;
        cAlpha         1.5;
        solver          PBiCGStab;
        smoother        DILU;
        tolerance       1e-8;
        relTol          0;
    }
    gammaFinal
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        smoother         DILU;
        tolerance        1e-10;
        relTol           0;
    }
    Theta
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
    }
    ThetaFinal
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }
    "(epsilon.fluid|k.fluid)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0;
    }

    "(epsilon.fluidFinal|k.fluidFinal)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor 0;
    nOuterCorrectors  1;
    nCorrectors 2;    // 4 PISO correctors for high pressure-velocity coupling fidelity
    nNonOrthogonalCorrectors 0; // 2 Non-orthogonal mesh corrector loops
    correctAlpha      0;
    nAlphasCorr       1;
    nGammaCorr        1;
    nAlphaSubCycles 1;    // 3 MULES interface sub-cycles for sharp VOF resolution
    MULESCorr         yes;
    nLimiterIter      5;
    cAlpha            1.5;  // Interface compression factor
}

relaxationFactors
{
    fields
    {
        p_rgh               0.3;
    }
    equations
    {
        U.solid             0.7;
        "U.*"               0.7;
        "k.*"               0.9;
        "epsilon.*"         0.9;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
