system/refineMeshDict.level3
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Project:  Bridge Deck Pressure-Flow Scour Study |
|    \\/     M anipulation  | Case:     3C_VOF Level 3 refineMeshDict         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      refineMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

set level3CellSet;

coordinateSystem global;

globalCoeffs
{
    tan1 (1 0 0);
    tan2 (0 1 0);
}

directions
(
    tan1
    tan2
);

useHexTopology true;
geometricCut false;
writeMesh true;

// ************************************************************************* //
