system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Project:  Bridge Deck Pressure-Flow Scour Study |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            sets;
libs            ("libsampling.so");

setFormat       raw;
interpolationScheme cell;

fields          (alpha.solid gamma U.fluid U.solid p_rgh k.fluid epsilon.fluid nut.fluid);

sets
(
    x_minus0p5
    {
        type        uniform;
        axis        y;
        start       (-0.5 -0.12 0.005);
        end         (-0.5 0.30 0.005);
        nPoints     200;
    }
    x_0p0765
    {
        type        uniform;
        axis        y;
        start       (0.0765 -0.12 0.005);
        end         (0.0765 0.30 0.005);
        nPoints     200;
    }
    x_0p4
    {
        type        uniform;
        axis        y;
        start       (0.4 -0.12 0.005);
        end         (0.4 0.30 0.005);
        nPoints     200;
    }
    x_0p8
    {
        type        uniform;
        axis        y;
        start       (0.8 -0.12 0.005);
        end         (0.8 0.30 0.005);
        nPoints     200;
    }
);

// ************************************************************************* //
