system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Project:  Bridge Deck Pressure-Flow Scour Study |
|    \\/     M anipulation  | Case:     3C_VOF setFieldsDict                      |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Default domain initialization: Air phase above water level
defaultFieldValues
(
    volScalarFieldValue gamma 0
    volScalarFieldValue alpha.solid 0.0
);

regions
(
    // 1. Water region: from initial bed surface (y = 0.0 m) up to water surface y = 0.1107 m
    boxToCell
    {
        box (-1.6 0.0 -0.01) (2.1 0.1107 0.02);
        fieldValues
        (
            volScalarFieldValue gamma 1
            volScalarFieldValue alpha.solid 0.0
        );
    }

    // 2. Erodible Sediment Bed region: from y = -0.13 m to y = 0.0 m
    // Saturated sand bed: alpha.solid = 0.60
    boxToCell
    {
        box (-1.6 -0.13 -0.01) (2.1 0.0 0.02);
        fieldValues
        (
            volScalarFieldValue gamma 1
            volScalarFieldValue alpha.solid 0.60
        );
    }
);

// ************************************************************************* //
